Revit 2027 API
Profile.Transformed Property
Transforms this profile and returns the result.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public Profile this[
	Transform transform
] { get; }
Public ReadOnly Property Transformed (
	transform As Transform
) As Profile
	Get
public:
property Profile^ Transformed[Transform^ transform] {
	Profile^ get (Transform^ transform);
}
member Transformed : Profile with get
Parameters
transform Transform
The transformation used to transform the profile.
Return Value
Profile
The transformed profile.
Exceptions
Exception | Condition
ArgumentNullException |  Thrown when the handle of the specified transformation is null.
InvalidOperationException |  Thrown when failed to transform a curve in the profile.
Remarks
Transforms all the curves that define the boundary of this profile.
See Also
Reference
Profile Class
Autodesk.Revit.DB Namespace